music_app/app/controllers/bands_controller.rb

SELECT "bands".* FROM "bands"
---
    def index
        @bands = Band.all

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Lola"], ["created_at", "2023-06-13 21:16:40.037316"], ["updated_at", "2023-06-13 21:16:40.037316"]]
---
    def create
        @band = Band.new(band_params)
        if @band.save!

UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "NelmaEdited"], ["updated_at", "2023-06-13 21:29:01.570680"], ["id", 1]]
---
    def update
        if @band.update(band_params)

SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_band
        @band = Band.find(params[:id])